# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors: 3
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, FEM, [256]]
  - [-2, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, FEM, [512]]
  - [-2, 1, Conv, [1024,3,2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAMC3, [1024]]
  - [-1, 1, SPPFCSPC, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, FFM_Concat2, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, FFM_Concat2, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)                  17

  - [-1,1,Involution,[256,1,1]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, FFM_Concat2, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)                 20

  - [-1,1,Involution,[512,1,1]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, FFM_Concat2, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)                 23

  - [ 18, 1, SCAM, [ ] ]# 24                28
  - [ 22, 1, SCAM, [ ] ] # 25                29
  - [ 26, 1, SCAM, [ ] ] # 26                30


  - [[27, 28, 29], 1, Detect, [nc, anchors]]  # Detect(P3, P4, P5)